Пансион83/src/Catalogs/Договора/Договора.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Договора</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Date</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Фирмы</types>
    </type>
  </attributes>
  <attributes>
    <name>ValidFromDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ValidToDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>PeriodCheckType</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AccountingCurrency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>RoomQuota</name>
    <type>
      <types>CatalogRef.КвотаНомеров</types>
    </type>
  </attributes>
  <attributes>
    <name>RoomRate</name>
    <type>
      <types>CatalogRef.Тарифы</types>
    </type>
  </attributes>
  <attributes>
    <name>RoomRateServiceGroup</name>
    <type>
      <types>CatalogRef.НаборыУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>DiscountType</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </attributes>
  <attributes>
    <name>DiscountConfirmationText</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>PlannedPaymentMethod</name>
    <type>
      <types>CatalogRef.СпособОплаты</types>
    </type>
  </attributes>
  <attributes>
    <name>Agent</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>AgentCommission</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AgentCommissionType</name>
    <type>
      <types>EnumRef.AgentCommissionTypes</types>
    </type>
  </attributes>
  <attributes>
    <name>AgentCommissionServiceGroup</name>
    <type>
      <types>CatalogRef.НаборыУслуг</types>
    </type>
  </attributes>
  <attributes>
    <name>FeeTerms</name>
    <type>
      <types>CatalogRef.ШтрафыУсловия</types>
    </type>
  </attributes>
  <attributes>
    <name>Remarks</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ExternalCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Color</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Author</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>CreateDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>MarketingCode</name>
    <type>
      <types>CatalogRef.КодМаркетинга</types>
    </type>
  </attributes>
  <attributes>
    <name>SourceOfBusiness</name>
    <type>
      <types>CatalogRef.ИсточИнфоГостиница</types>
    </type>
  </attributes>
  <attributes>
    <name>ClientType</name>
    <type>
      <types>CatalogRef.ТипыКлиентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ClientTypeConfirmationText</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DaysBeforeCheckIn</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DaysAfterReservation</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>DaysAfterSettlement</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Гостиница</name>
    <type>
      <types>CatalogRef.Гостиницы</types>
    </type>
  </attributes>
  <attributes>
    <name>RoomRatesApproved</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>NoDiscounts</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractType</name>
    <type>
      <types>CatalogRef.ТипыДоговоров</types>
    </type>
  </attributes>
  <attributes>
    <name>ContractAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ChargingRules</name>
    <attributes>
      <name>ChargingRule</name>
      <type>
        <types>EnumRef.ChargingRuleTypes</types>
      </type>
    </attributes>
    <attributes>
      <name>ChargingRuleValue</name>
      <type>
        <types>CatalogRef.Услуги</types>
        <types>CatalogRef.НаборыУслуг</types>
        <types>CatalogRef.ТипыНомеров</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>17</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ChargingFolio</name>
      <type>
        <types>DocumentRef.СчетПроживания</types>
      </type>
    </attributes>
    <attributes>
      <name>ValidFromDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ValidToDate</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>IsPersonal</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>RoomRates</name>
    <attributes>
      <name>RoomRate</name>
      <type>
        <types>CatalogRef.Тарифы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Пансион83/src/InformationRegisters/ИсторияИзмРеквДоговоров/ИсторияИзмРеквДоговоров.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ИсторияИзмРеквДоговоров</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Code</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Date</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>Description</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>AccountingCurrency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>Company</name>
    <type>
      <types>CatalogRef.Фирмы</types>
    </type>
  </resources>
  <resources>
    <name>ValidFromDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ValidToDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>PeriodCheckType</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>1</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>RoomQuota</name>
    <type>
      <types>CatalogRef.КвотаНомеров</types>
    </type>
  </resources>
  <resources>
    <name>RoomRate</name>
    <type>
      <types>CatalogRef.Тарифы</types>
    </type>
  </resources>
  <resources>
    <name>RoomRateServiceGroup</name>
    <type>
      <types>CatalogRef.НаборыУслуг</types>
    </type>
  </resources>
  <resources>
    <name>DiscountType</name>
    <type>
      <types>CatalogRef.ТипыСкидок</types>
    </type>
  </resources>
  <resources>
    <name>DiscountConfirmationText</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ContractCurrency</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </resources>
  <resources>
    <name>PlannedPaymentMethod</name>
    <type>
      <types>CatalogRef.СпособОплаты</types>
    </type>
  </resources>
  <resources>
    <name>Agent</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>AgentCommission</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>AgentCommissionType</name>
    <type>
      <types>EnumRef.AgentCommissionTypes</types>
    </type>
  </resources>
  <resources>
    <name>AgentCommissionServiceGroup</name>
    <type>
      <types>CatalogRef.НаборыУслуг</types>
    </type>
  </resources>
  <resources>
    <name>FeeTerms</name>
    <type>
      <types>CatalogRef.ШтрафыУсловия</types>
    </type>
  </resources>
  <resources>
    <name>MarketingCode</name>
    <type>
      <types>CatalogRef.КодМаркетинга</types>
    </type>
  </resources>
  <resources>
    <name>SourceOfBusiness</name>
    <type>
      <types>CatalogRef.ИсточИнфоГостиница</types>
    </type>
  </resources>
  <resources>
    <name>ClientType</name>
    <type>
      <types>CatalogRef.ТипыКлиентов</types>
    </type>
  </resources>
  <resources>
    <name>ClientTypeConfirmationText</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ChargingRules</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>RoomRates</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </resources>
  <resources>
    <name>ExternalCode</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Remarks</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>DaysBeforeCheckIn</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>DaysAfterReservation</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>DaysAfterSettlement</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Гостиница</name>
    <type>
      <types>CatalogRef.Гостиницы</types>
    </type>
  </resources>
  <resources>
    <name>NoDiscounts</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ContractType</name>
    <type>
      <types>CatalogRef.ТипыДоговоров</types>
    </type>
  </resources>
  <resources>
    <name>ContractAmount</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>17</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>RoomRatesApproved</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Author</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </resources>
  <resources>
    <name>CreateDate</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>Changes</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <attributes>
    <name>User</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <dimensions>
    <name>Contract</name>
    <type>
      <types>CatalogRef.Договора</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Пансион83/src/Enums/ChargingRuleTypes/ChargingRuleTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ChargingRuleTypes</name>
  <enumValues>
    <name>InRate</name>
  </enumValues>
  <enumValues>
    <name>NotInRate</name>
  </enumValues>
  <enumValues>
    <name>InServiceGroup</name>
  </enumValues>
  <enumValues>
    <name>NotInServiceGroup</name>
  </enumValues>
  <enumValues>
    <name>One</name>
  </enumValues>
  <enumValues>
    <name>AllButOne</name>
  </enumValues>
  <enumValues>
    <name>RoomRevenuePrice</name>
  </enumValues>
  <enumValues>
    <name>RoomRevenuePricePercent</name>
  </enumValues>
  <enumValues>
    <name>RoomRevenuePriceByRoomType</name>
  </enumValues>
  <enumValues>
    <name>RoomRevenueAmount</name>
  </enumValues>
  <enumValues>
    <name>RestOfRoomRevenuePrice</name>
  </enumValues>
  <enumValues>
    <name>Any</name>
  </enumValues>
</mdclass:Enum>

Пансион83/src/Catalogs/Договора/ObjectModule.bsl
//-----------------------------------------------------------------------------
Процедура pmCreateFolios(pHotel, pDate) Экспорт
	vChargingRules = Неопределено;
	If ЗначениеЗаполнено(Owner) And ЗначениеЗаполнено(Owner.Parent) Тогда
		If Owner.Parent.ChargingRules.Count() > 0 Тогда
			vChargingRules = Owner.Parent.ChargingRules.Unload();
		EndIf;
	EndIf;
	If vChargingRules = Неопределено Тогда
		If ЗначениеЗаполнено(pHotel) Тогда
			If pHotel.CustomerChargingRules.Count() > 0 Тогда
				vChargingRules = pHotel.CustomerChargingRules.Unload();
			EndIf;
		Else
			Return;
		EndIf;
	EndIf;
	// Check list of template rules
	If vChargingRules = Неопределено Тогда
		// Create new folio and take parameters from the hotel
		vFolioObj = Documents.СчетПроживания.CreateDocument();
		
		vFolioObj.Гостиница = Справочники.Гостиницы.EmptyRef();
		vFolioObj.Контрагент = Owner;
		vFolioObj.Договор = Ref;
		If ЗначениеЗаполнено(pHotel) And ЗначениеЗаполнено(pHotel.PaymentMethodForCustomerPayments) Тогда
			vFolioObj.СпособОплаты = pHotel.PaymentMethodForCustomerPayments;
		ElsIf ЗначениеЗаполнено(PlannedPaymentMethod) Тогда
			vFolioObj.СпособОплаты = PlannedPaymentMethod;
		EndIf;
		If ЗначениеЗаполнено(AccountingCurrency) Тогда
			vFolioObj.ВалютаЛицСчета = AccountingCurrency;
		EndIf;
		vFolioObj.Write();
		
		// Add it to the charging rules
		vCR = ChargingRules.Add();
		vCR.СпособРазделенияОплаты = Перечисления.ChargingRuleTypes.InRate;
		vCR.ChargingFolio = vFolioObj.Ref;
	Else
		For Each vRule In vChargingRules Do
			// Create new folio from template
			vFolioObj = Documents.СчетПроживания.CreateDocument();
			
			vFolioObj.Гостиница = Справочники.Гостиницы.EmptyRef();
			vFolioObj.Контрагент = Owner;
			vFolioObj.Договор = Ref;
			If ЗначениеЗаполнено(AccountingCurrency) Тогда
				vFolioObj.ВалютаЛицСчета = AccountingCurrency;
			EndIf;
			vFolioObj.IsMaster = vRule.ChargingFolio.IsMaster;
			vFolioObj.Write();
			
			// Add it to the charging rules
			vCR = ChargingRules.Add();
			FillPropertyValues(vCR, vRule, , "ChargingFolio");
			vCR.ChargingFolio = vFolioObj.Ref;
		EndDo;
	EndIf;
КонецПроцедуры //pmCreateFolios

//-----------------------------------------------------------------------------
Процедура pmFillAttributesWithDefaultValues() Экспорт
	// Author and date
	Author = ПараметрыСеанса.ТекПользователь;
	CreateDate = CurrentDate();
	// Initialization based on hotel
	vHotel = ПараметрыСеанса.ТекущаяГостиница;
	If ЗначениеЗаполнено(vHotel) Тогда
		// Currency
		If НЕ ЗначениеЗаполнено(AccountingCurrency) Тогда
			AccountingCurrency = vHotel.ВалютаЛицСчета;
		EndIf;
		// Planned payment method
		PlannedPaymentMethod = vHotel.PlannedPaymentMethod;
		// Default charging rules
		If vHotel.AlwaysCreateDefaultChargingRulesForNewCustomers Тогда
			pmCreateFolios(vHotel, CreateDate);
		ElsIf ЗначениеЗаполнено(Owner) Тогда
			vParent = Owner.Parent;
			While ЗначениеЗаполнено(vParent) Do
				If vParent.AlwaysCreateDefaultChargingRulesForNewCustomers Тогда
					pmCreateFolios(vHotel, CreateDate);
					Break;
				EndIf;
				vParent = vParent.Parent;
			EndDo;
		EndIf;
	EndIf;
КонецПроцедуры //pmFillAttributesWithDefaultValues

//-----------------------------------------------------------------------------
Function pmCheckContractAttributes(pMessage, pAttributeInErr) Экспорт
	vHasErrors = False;
	pMessage = "";
	pAttributeInErr = "";
	vMsgTextRu = "";
	vMsgTextEn = "";
	If IsBlankString(Code) Тогда
		vHasErrors = True; 
		vMsgTextRu = vMsgTextRu + "Реквизит <Код> должен быть заполнен!" + Chars.LF;
		vMsgTextEn = vMsgTextEn + "<Code> attribute should be filled!" + Chars.LF;
		pAttributeInErr = ?(pAttributeInErr = "", "Code", pAttributeInErr);
	EndIf;
	If IsBlankString(Description) Тогда
		vHasErrors = True; 
		vMsgTextRu = vMsgTextRu + "Реквизит <Наименование> должен быть заполнен!" + Chars.LF;
		vMsgTextEn = vMsgTextEn + "<Description> attribute should be filled!" + Chars.LF;
		pAttributeInErr = ?(pAttributeInErr = "", "Description", pAttributeInErr);
	EndIf;
	If НЕ ЗначениеЗаполнено(Owner) Тогда
		vHasErrors = True; 
		vMsgTextRu = vMsgTextRu + "Реквизит <Контрагент> должен быть заполнен!" + Chars.LF;
		vMsgTextEn = vMsgTextEn + "<Контрагент> attribute should be filled!" + Chars.LF;
		pAttributeInErr = ?(pAttributeInErr = "", "Owner", pAttributeInErr);
	EndIf;
	If НЕ ЗначениеЗаполнено(AccountingCurrency) Тогда
		vHasErrors = True; 
		vMsgTextRu = vMsgTextRu + "Реквизит <Валюта взаиморасчетов> должен быть заполнен!" + Chars.LF;
		vMsgTextEn = vMsgTextEn + "<Accounting Валюта> attribute should be filled!" + Chars.LF;
		pAttributeInErr = ?(pAttributeInErr = "", "ВалютаРасчетов", pAttributeInErr);
	EndIf;
	If vHasErrors Тогда
		pMessage = "ru = '" + СокрЛП(vMsgTextRu) + "';" + "en = '" + СокрЛП(vMsgTextEn) + "';";
	EndIf;
	Return vHasErrors;
EndFunction //pmCheckContractAttributes

//-----------------------------------------------------------------------------


//-----------------------------------------------------------------------------


//-----------------------------------------------------------------------------
Function pmGetPreviousObjectState(pPeriod) Экспорт
	vQry = New Query();
	vQry.Text = 
	"SELECT
	|	*
	|FROM
	|	InformationRegister.ИсторияИзмРеквДоговоров.SliceLast(&qPeriod, Договор = &qRef) AS ИсторияИзмРеквДоговоров";
	vQry.SetParameter("qPeriod", pPeriod);
	vQry.SetParameter("qRef", Ref);
	vStates = vQry.Execute().Unload();
	If vStates.Count() > 0 Тогда
		Return vStates.Get(0);
	Else
		Return Неопределено;
	EndIf;
EndFunction //pmGetPreviousObjectState

//-----------------------------------------------------------------------------
Процедура pmRestoreAttributesFromHistory(pChgRec) Экспорт
	FillPropertyValues(ThisObject, pChgRec, , "Code, Description");
	If НЕ IsBlankString(pChgRec.Code) Тогда
		Code = pChgRec.Code;
	EndIf;
	If НЕ IsBlankString(pChgRec.Description) Тогда
		Description = pChgRec.Description;
	EndIf;
	// Restore tabular parts
	vChargingRules = pChgRec.ChargingRules.Get();
	If vChargingRules <> Неопределено Тогда
		ChargingRules.Load(vChargingRules);
	Else
		ChargingRules.Clear();
	EndIf;
	vRoomRates = pChgRec.Тарифы.Get();
	If vRoomRates <> Неопределено Тогда
		RoomRates.Load(vRoomRates);
	Else
		RoomRates.Clear();
	EndIf;
КонецПроцедуры //pmRestoreAttributesFromHistory

//-----------------------------------------------------------------------------
Процедура OnCopy(pCopiedObject)
	ExternalCode = "";
	// Author and date
	Author = ПараметрыСеанса.ТекПользователь;
	CreateDate = CurrentDate();
КонецПроцедуры //OnCopy

//-----------------------------------------------------------------------------
// Get characteristics
// Returns ValueTable 
//-----------------------------------------------------------------------------
Function pmGetLimitsAndConditions() Экспорт
	// Build and run query
	vQry = New Query;
	vQry.Text = 
	"SELECT
	|	LimitsAndSpecialConditions.Owner AS Договор,
	|	LimitsAndSpecialConditions.Гостиница,
	|	LimitsAndSpecialConditions.Characteristic,
	|	LimitsAndSpecialConditions.CharacteristicValue
	|FROM
	|	InformationRegister.LimitsAndSpecialConditions AS LimitsAndSpecialConditions
	|WHERE
	|	LimitsAndSpecialConditions.Owner = &qContract
	|	AND (LimitsAndSpecialConditions.Гостиница = &qHotel
	|			OR LimitsAndSpecialConditions.Гостиница = &qEmptyHotel
	|			OR LimitsAndSpecialConditions.Гостиница = &qCurrentHotel)
	|	AND LimitsAndSpecialConditions.Characteristic.DeletionMark = FALSE
	|
	|ORDER BY
	|	LimitsAndSpecialConditions.Characteristic.Code";
	vQry.SetParameter("qContract", Ref);
	vQry.SetParameter("qHotel", Гостиница);
	vQry.SetParameter("qEmptyHotel", Справочники.Гостиницы.EmptyRef());
	vQry.SetParameter("qCurrentHotel", ПараметрыСеанса.ТекущаяГостиница);
	vChars = vQry.Execute().Unload();
	Return vChars;
EndFunction //pmGetLimitsAndConditions

//-----------------------------------------------------------------------------
// Get characteristic value
// Returns Value
//-----------------------------------------------------------------------------
Function pmGetLimitsAndConditionsValue(pCharacteristic, pHotel) Экспорт
	vCharValue = Неопределено;
	// Build and run query
	vQry = New Query;
	vQry.Text = 
	"SELECT
	|	LimitsAndSpecialConditions.CharacteristicValue
	|FROM
	|	InformationRegister.LimitsAndSpecialConditions AS LimitsAndSpecialConditions
	|WHERE
	|	LimitsAndSpecialConditions.Owner = &qContract
	|	AND (LimitsAndSpecialConditions.Гостиница = &qHotel OR LimitsAndSpecialConditions.Гостиница = &qEmptyHotel)
	|	AND LimitsAndSpecialConditions.Characteristic = &qCharacteristic
	|
	|ORDER BY
	|	LimitsAndSpecialConditions.Characteristic.Code";
	vQry.SetParameter("qContract", Ref);
	vQry.SetParameter("qHotel", pHotel);
	vQry.SetParameter("qEmptyHotel", Справочники.Гостиницы.EmptyRef());
	vQry.SetParameter("qCharacteristic", pCharacteristic);
	vChars = vQry.Execute().Choose();
	While vChars.Next() Do
		vCharValue = vChars.CharacteristicValue;
		Break;
	EndDo;
	Return vCharValue;
EndFunction //pmGetLimitsAndConditionsValue

//-----------------------------------------------------------------------------
Процедура pmSaveLimitsAndConditionsValue(pCharacteristic, pCharacteristicValue, pHotel) Экспорт
	vCharsMgr = InformationRegisters.LimitsAndSpecialConditions.CreateRecordManager();
	vCharsMgr.Owner = Ref;
	vCharsMgr.Characteristic = pCharacteristic;
	vCharsMgr.Гостиница = pHotel;
	vCharsMgr.Read();
	If vCharsMgr.Selected() Тогда
		vCharsMgr.Owner = Ref;
		vCharsMgr.Characteristic = pCharacteristic;
		vCharsMgr.CharacteristicValue = pCharacteristicValue;
		vCharsMgr.Гостиница = pHotel;
		vCharsMgr.Write();
	EndIf;
КонецПроцедуры //pmSaveLimitsAndConditionsValue
